Revit 2027 API
SchemaBuilder.SetWriteAccessLevel Method
 Sets top level write access (for entities)
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SchemaBuilder SetWriteAccessLevel(
	AccessLevel writeAccessLevel
)
Public Function SetWriteAccessLevel (
	writeAccessLevel As AccessLevel
) As SchemaBuilder
public:
SchemaBuilder^ SetWriteAccessLevel(
	AccessLevel writeAccessLevel
)
member SetWriteAccessLevel :
        writeAccessLevel : AccessLevel -> SchemaBuilder
Parameters
writeAccessLevel AccessLevel
 Write access level value to be set
Return Value
SchemaBuilder
 The SchemaBuilder object may be used to add more settings.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  The SchemaBuilder has already finished building the Schema.
See Also
Reference
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace